IDENTIFICATION DIVISION.
PROGRAM-ID. SUMA.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM1 PIC 9(3).
01 NUM2 PIC 9(3).
01 SUMA PIC 9(4).
PROCEDURE DIVISION.
    ACCEPT NUM1 FROM stdin.
    ACCEPT NUM2 FROM stdin.
    COMPUTE SUMA = NUM1 + NUM2.
    DISPLAY SUMA.
    STOP RUN.


