IDENTIFICATION DIVISION.
PROGRAM-ID. ArraySum.
DATA DIVISION.
WORKING-STORAGE SECTION.
   01 Numbers       PIC 9(3) OCCURS 8 TIMES.
   01 Sum           PIC 9(4).
PROCEDURE DIVISION.
   PERFORM READ-NUMBERS
   PERFORM SUM-ARRAY
   DISPLAY Sum
   STOP RUN.

READ-NUMBERS.
   PERFORM VARYING I FROM 1 BY 1 UNTIL I > 8
      ACCEPT Numbers(I)
   END-PERFORM.

SUM-ARRAY.
   SET Sum TO 0
   PERFORM VARYING I FROM 1 BY 1 UNTIL I > 8
      ADD Numbers(I) TO Sum
   END-PERFORM.


