IDENTIFICATION DIVISION.
PROGRAM-ID. VECTOR-COMPARISON.
DATA DIVISION.
WORKING-STORAGE SECTION.
  01 ARRAY1 PIC 99 OCCURS 4 TIMES.
  01 ARRAY2 PIC 99 OCCURS 4 TIMES.
  01 INDEX PIC 99 VALUE 1.
PROCEDURE DIVISION.
  MOVE 5 TO ARRAY1(1)
  MOVE 2 TO ARRAY1(2)
  MOVE 7 TO ARRAY1(3)
  MOVE 1 TO ARRAY1(4)
  MOVE 3 TO ARRAY2(1)
  MOVE 6 TO ARRAY2(2)
  MOVE 4 TO ARRAY2(3)
  MOVE 9 TO ARRAY2(4)
  
  PERFORM VARYING INDEX FROM 1 BY 1 UNTIL INDEX > 4
    DISPLAY "Posición " INDEX ":" 
    IF ARRAY1(INDEX) < ARRAY2(INDEX)
      DISPLAY ARRAY1(INDEX)
    ELSE
      DISPLAY ARRAY2(INDEX)
    END-IF
  END-PERFORM.
  
  STOP RUN.


